In [1]:
import numpy as np
import pandas as pd

In [2]:
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)

In [3]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [4]:
pop[('California', 2000) : ('New York', 2010)]

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
dtype: int64

In [5]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

用元组表示索引其实是多级索引的基础，Pandas的 MultiIndex 类型提供了更丰富的操作方法。

In [6]:
# 通过元组创建多级索引
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [7]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [10]:
# 字面意思，不堆叠，转换成dataFrame
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [11]:
# 二维表转换成多级索引
pop = pop_df.stack()
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [12]:
pop_df = pd.DataFrame({'total': pop,
'under18': [9267089, 9284094,
4687374, 4318033,
5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [13]:
under18_df = pop_df['under18'] / pop_df['total']
under18_df

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [14]:
under18_df.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

## 多级索引的创建方法

In [15]:
# 将 index 参数设置为至少二维的索引数组
df = pd.DataFrame(np.random.rand(4, 2),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=['data1', 'data2'])
df

        data1     data2
a 1  0.470126  0.493432
  2  0.214418  0.697193
b 1  0.512019  0.432720
  2  0.037801  0.424721

In [16]:
df.unstack()

      data1               data2
          1         2         1         2
a  0.470126  0.214418  0.493432  0.697193
b  0.512019  0.037801  0.432720  0.424721

In [17]:
# 将元组作为键的字典传递给
data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

### 创建多级索引方法

In [18]:
# from_arrays ，通过数组创建多级索引。
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [20]:
# from_tuples ，通过元组创建多级索引。
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [21]:
# from_product ，通过笛卡尔积创建多级索引。
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [22]:
# 更可以直接提供 levels （包含每个等级的索引值列表的列表）和 labels （包含每个索引值标签列表的列表）创建 MultiIndex ：
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [24]:
# 为多级索引设置名称
pop.index.names = ['state', 'year']
pop.index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['state', 'year'])

In [25]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [26]:
# 多级行列索引
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],names=['subject', 'type'])

In [27]:
# 模拟数据
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

In [28]:
# 创建DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      38.0  36.6  24.0  36.4  36.0  36.7
     2      38.0  36.6  36.0  37.4  48.0  39.2
2014 1      31.0  37.8  42.0  36.1  31.0  35.9
     2      39.0  38.0  22.0  36.1   9.0  36.8

In [32]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      24.0  36.4
     2      36.0  37.4
2014 1      42.0  36.1
     2      22.0  36.1

## 多级索引的取值与切片

### Series取值与切片

In [33]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [34]:
# 切片
pop['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [35]:
# 掩码
pop[pop > 20851820]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [36]:
# 局部取值
pop['Texas',2000]

20851820

In [38]:
# 切片
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [39]:
# 花俏的索引
pop[['New York','California']]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

### DataFrame的取值与切片

In [41]:
# 再次提醒，DataFrame的基础索引是列索引
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      38.0  36.6  24.0  36.4  36.0  36.7
     2      38.0  36.6  36.0  37.4  48.0  39.2
2014 1      31.0  37.8  42.0  36.1  31.0  35.9
     2      39.0  38.0  22.0  36.1   9.0  36.8

In [42]:
health_data['Guido','HR']

year  visit
2013  1        24.0
      2        36.0
2014  1        42.0
      2        22.0
Name: (Guido, HR), dtype: float64

In [45]:
# iloc 先行后列
health_data.iloc[:3,:3]

subject      Bob       Guido
type          HR  Temp    HR
year visit
2013 1      38.0  36.6  24.0
     2      38.0  36.6  36.0
2014 1      31.0  37.8  42.0

In [46]:
# loc 和 iloc 中可以传递多个层级的索引元组
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        38.0
      2        38.0
2014  1        31.0
      2        39.0
Name: (Bob, HR), dtype: float64

In [47]:
# 多级索引的切片，最好不用使用元组，而要用IndexSlince
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      38.0  24.0  36.0
2014 1      31.0  42.0  31.0

## 多级索引行列转换

In [50]:
# 索引在无序情况下做切片是会出错的，排序函数如下：
# sort_index()

In [51]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [52]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [53]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [54]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [55]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## 多级索引的数据累计方法

In [56]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      38.0  36.6  24.0  36.4  36.0  36.7
     2      38.0  36.6  36.0  37.4  48.0  39.2
2014 1      31.0  37.8  42.0  36.1  31.0  35.9
     2      39.0  38.0  22.0  36.1   9.0  36.8

In [63]:
# 通过指定level，则可以对行级索引进行数据处理，例如：
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR   Temp
year
2013     38.0  36.6  30.0  36.9  42.0  37.95
2014     35.0  37.9  32.0  36.1  20.0  36.35

In [65]:
# 再通过参数axis = 1，则可对所有列进行处理，
data_mean.mean(level='type',axis='columns')

type         HR       Temp
year
2013  36.666667  37.150000
2014  29.000000  36.783333